#20강,21강, 22강

#[1]:산술 연산자
# + - * / //(나눔의 몫) **(제곱) %(나머지)
print(10//3)
print(3**3)
print(10%3)


#정수형끼리의 연산은 결과 -> 정수형
#실수형끼리의 연산 결과 -> 실수형
#정수형과 실수형의 연산 결과 -> 실수형

#[2]:관계 연산자
#대소비교를 하거나 같은지 같지 않은지
# > < >= <= ==(같다) !=(같지 않다)
print(10!=10)
print(10>9)
print(10>=8)
print(10==10)
# 비교) print(10 is 10)

#[3]:논리 연산자
#and, or, not
#and -> 양쪽 값이 모두 참
#or -> 어느 한쪽만 참이어도 참
#not -> 참은 거짓, 거짓은 참

a=True
b=False
print(a and b)
print(a or b)
print(not a)
print(not b)

#----^자주 쓰이는 연산자 익숙해지자

#[4]: 부울(Boolean) 연산자
#True, False 값으로 출력

